; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	infrared5 - mode
	infrared2 - mode
	thermograph0 - mode
	thermograph3 - mode
	spectrograph4 - mode
	image1 - mode
	Star0 - direction
	Star1 - direction
	Star2 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star6 - direction
	Star7 - direction
	GroundStation8 - direction
	Star5 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(supports instrument0 image1)
	(supports instrument0 thermograph3)
	(supports instrument0 thermograph0)
	(supports instrument0 infrared2)
	(supports instrument0 infrared5)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Star9 image1)
	(have_image Star10 thermograph0)
	(have_image Phenomenon11 thermograph3)
	(have_image Phenomenon11 image1)
	(have_image Phenomenon12 infrared2)
	(have_image Phenomenon12 thermograph3)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
2. (turn_to satellite0 star5 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star5)
   goals met: 0 of 7
3. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 phenomenon11)
   goals met: 0 of 7
5. (take_image satellite0 phenomenon11 instrument0 image1)
   added: (have_image phenomenon11 image1)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon11 instrument0 thermograph3)
   added: (have_image phenomenon11 thermograph3)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon12 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon12 instrument0 infrared2)
   added: (have_image phenomenon12 infrared2)
   goals met: 3 of 7
9. (take_image satellite0 phenomenon12 instrument0 thermograph3)
   added: (have_image phenomenon12 thermograph3)
   goals met: 4 of 7
10. (turn_to satellite0 star0 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star0)
   goals met: 5 of 7
11. (turn_to satellite0 star10 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star10)
   goals met: 4 of 7
12. (take_image satellite0 star10 instrument0 thermograph0)
   added: (have_image star10 thermograph0)
   goals met: 5 of 7
13. (turn_to satellite0 star0 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star0)
   goals met: 6 of 7
14. (turn_to satellite0 star9 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 star9)
   goals met: 5 of 7
15. (take_image satellite0 star9 instrument0 image1)
   added: (have_image star9 image1)
   goals met: 6 of 7
16. (turn_to satellite0 star0 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star0)
   goals met: 7 of 7
